In [1]:
%matplotlib inline
import sys
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
d = {'col1': np.arange(1,12,1), 'col2': np.arange(1,12,1)}
list = pd.DataFrame(data=d)
list

    col1  col2
0      1     1
1      2     2
2      3     3
3      4     4
4      5     5
5      6     6
6      7     7
7      8     8
8      9     9
9     10    10
10    11    11

In [3]:
list.drop([2,3,6], inplace=True)
list

    col1  col2
0      1     1
1      2     2
4      5     5
5      6     6
7      8     8
8      9     9
9     10    10
10    11    11

Let's fill in those spaces with nan values now

In [4]:
list1=list.reindex(range(11))
list1

    col1  col2
0    1.0   1.0
1    2.0   2.0
2    NaN   NaN
3    NaN   NaN
4    5.0   5.0
5    6.0   6.0
6    NaN   NaN
7    8.0   8.0
8    9.0   9.0
9   10.0  10.0
10  11.0  11.0

For working with dates it's recommeded to use a start and end function to fill in the dates that are missing and then outer join the series with the missing data i.e.

In [10]:
from datetime import datetime
start = datetime(2012,5,1)
end = datetime(2012,6,2)
d= pd.DataFrame(index=pd.date_range(start, end))

You could also index from the min and max of your data set and then outer join from there

In [12]:
start = dfname.index.min()
end = dfname.index.max()
d= pd.DataFrame(index=pd.date_range(start, end))

NameError: name 'dfname' is not defined

examples using inconsitant dates can be found in tutorial 1